CSI API ETABS v1
cAnalysisResults.ModalParticipationFactors Method
 Reports the modal participation factors for each mode of each selected modal analysis case
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int ModalParticipationFactors(
	ref int NumberResults,
	ref string[] LoadCase,
	ref string[] StepType,
	ref double[] StepNum,
	ref double[] Period,
	ref double[] UX,
	ref double[] UY,
	ref double[] UZ,
	ref double[] RX,
	ref double[] RY,
	ref double[] RZ,
	ref double[] ModalMass,
	ref double[] ModalStiff
)
Function ModalParticipationFactors (
	ByRef NumberResults As Integer,
	ByRef LoadCase As String(),
	ByRef StepType As String(),
	ByRef StepNum As Double(),
	ByRef Period As Double(),
	ByRef UX As Double(),
	ByRef UY As Double(),
	ByRef UZ As Double(),
	ByRef RX As Double(),
	ByRef RY As Double(),
	ByRef RZ As Double(),
	ByRef ModalMass As Double(),
	ByRef ModalStiff As Double()
) As Integer
Dim instance As cAnalysisResults
Dim NumberResults As Integer
Dim LoadCase As String()
Dim StepType As String()
Dim StepNum As Double()
Dim Period As Double()
Dim UX As Double()
Dim UY As Double()
Dim UZ As Double()
Dim RX As Double()
Dim RY As Double()
Dim RZ As Double()
Dim ModalMass As Double()
Dim ModalStiff As Double()
Dim returnValue As Integer
returnValue = instance.ModalParticipationFactors(NumberResults,
	LoadCase, StepType, StepNum, Period,
	UX, UY, UZ, RX, RY, RZ, ModalMass, ModalStiff)
int ModalParticipationFactors(
	int% NumberResults,
	array<String^>^% LoadCase,
	array<String^>^% StepType,
	array<double>^% StepNum,
	array<double>^% Period,
	array<double>^% UX,
	array<double>^% UY,
	array<double>^% UZ,
	array<double>^% RX,
	array<double>^% RY,
	array<double>^% RZ,
	array<double>^% ModalMass,
	array<double>^% ModalStiff
)
abstract ModalParticipationFactors :
        NumberResults : int byref *
        LoadCase : string[] byref *
        StepType : string[] byref *
        StepNum : float[] byref *
        Period : float[] byref *
        UX : float[] byref *
        UY : float[] byref *
        UZ : float[] byref *
        RX : float[] byref *
        RY : float[] byref *
        RZ : float[] byref *
        ModalMass : float[] byref *
        ModalStiff : float[] byref -> int
Parameters
NumberResults
Type: System.Int32
 The total number of results returned by the program
LoadCase
Type: System.String[]
 This is an array that includes the name of the modal load case associated with each result
StepType
Type: System.String[]
 This is an array that includes the step type, if any, for each result. For modal results, this will always be Mode
StepNum
Type: System.Double[]
 This is an array that includes the step number for each result. For modal results, this is always the mode number
Period
Type: System.Double[]
 This is an array that includes the period for each result. [s]
UX
Type: System.Double[]
 This is an array that includes the modal participation factor for the structure Ux degree of freedom. The ratio applies to the specified mode. [Fs2]
UY
Type: System.Double[]
 This is an array that includes the modal participation factor for the structure Uy degree of freedom. The ratio applies to the specified mode. [Fs2]
UZ
Type: System.Double[]
 This is an array that includes the modal participation factor for the structure Uz degree of freedom. The ratio applies to the specified mode. [Fs2]
RX
Type: System.Double[]
 This is an array that includes the modal participation factor for the structure Rx degree of freedom. The ratio applies to the specified mode. [FLs2]
RY
Type: System.Double[]
 This is an array that includes the modal participation factor for the structure Ry degree of freedom. The ratio applies to the specified mode. [FLs2]
RZ
Type: System.Double[]
 This is an array that includes the modal participation factor for the structure Rz degree of freedom. The ratio applies to the specified mode. [FLs2]
ModalMass
Type: System.Double[]
 This is an array that includes the modal mass for the specified mode. This is a measure of the kinetic energy in the structure as it is deforming in the specified mode. [FLs2]
ModalStiff
Type: System.Double[]
 This is an array that includes the modal stiffness for the specified mode. This is a measure of the strain energy in the structure as it is deforming in the specified mode. [FL]
Return Value
Type: Int32
 Returns zero if the data is successfully recovered; otherwise it returns a nonzero value
Remarks
 See Results for more information.
Examples
Public Sub Example()
   'dimension variables
   Dim SapObject as cOAPI
   Dim SapModel As cSapModel
   Dim ret As Integer = -1
   Dim NumberResults As Integer
   Dim LoadCase() As String
   Dim StepType() As String
   Dim StepNum() As Double
   Dim Period() As Double
   Dim Ux() As Double
   Dim Uy() As Double
   Dim Uz() As Double
   Dim Rx() As Double
   Dim Ry() As Double
   Dim Rz() As Double
   Dim ModalMass() As Double
   Dim ModalStiff() As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis()
   'deselect all cases and combos
       ret = SapModel.Results.Setup.DeselectAllCasesAndCombosForOutput()
   'set case selected for output
       ret = SapModel.Results.Setup.SetCaseSelectedForOutput("MODAL")
   'get modal participation factors
       ret = SapModel.Results.ModalParticipationFactors(NumberResults, LoadCase, StepType, StepNum, Period, Ux, Uy, Uz, Rx, Ry, Rz, ModalMass, ModalStiff)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalysisResults Interface
ETABSv1 Namespace